Pandas - DataFrame And series

Pandas is a powerful data manipulation libraby in python,widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame.A series is a one-dimensional array-like object,while a DataFrame is a two-dimensional,size-mutual,and potentially,hetrogenous tabular data structure with labeled axes(rows and columns)

In [2]:
import pandas as pd

In [4]:
## series 
## A pandas series is a one dimensional array-like object that can hold any data type. It is similar to a column in a table
data=[1,2,3,4,5]
series=pd.Series(data)

In [5]:
print(series)## left side isindexes

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
## create a series from dictonary 
data ={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)

In [7]:
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
data = [10,20,30]
index =['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
## DataFrame
## create a dataFrame from dictonry of list

data={
    'Name':['Deepesh','Akanksha','krish'],
    'Age':[25,24,34],
    'City':["Mumbai",'Mumbai',"Banglore"]

}
df=pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age      City
0   Deepesh   25    Mumbai
1  Akanksha   24    Mumbai
2     krish   34  Banglore
<class 'pandas.core.frame.DataFrame'>

In [12]:
import numpy as np
np.array(df)

array([['Deepesh', 25, 'Mumbai'],
       ['Akanksha', 24, 'Mumbai'],
       ['krish', 34, 'Banglore']], dtype=object)

In [13]:
## create a dataFrame from list of dictionaries
data=[
    {'Name':'Deepesh','Age':25,'City':'Pune'},## one row
    {'Name':'Akanksha','Age':24,'City':'Pune'},
    {'Name':'Krish','Age':35,'City':'Banglore'}
]

df1=pd.DataFrame(data)

In [14]:
print(df1)

       Name  Age      City
0   Deepesh   25      Pune
1  Akanksha   24      Pune
2     Krish   35  Banglore

In [ ]:
## read csv
df=pd.read_csv()
df.head()

In [15]:
## acessing data from dataframe
df['Name']

0     Deepesh
1    Akanksha
2       krish
Name: Name, dtype: object

In [16]:
type(df['Name'])## series

pandas.core.series.Series

In [19]:
df.loc[0][0]## location

'Deepesh'

In [21]:
df.iloc[0]## index location

Name    Deepesh
Age          25
City     Mumbai
Name: 0, dtype: object

In [22]:
## accessing a specified element
df.at[1,"Age"]

24

In [23]:
df.at[2,'Name']

'krish'

In [25]:
## acessing specifed element using iat

df.iat[2,2]## both row index and bolumn index

'Banglore'

In [26]:
## data manipulation with dataframes
df

       Name  Age      City
0   Deepesh   25    Mumbai
1  Akanksha   24    Mumbai
2     krish   34  Banglore

In [27]:
df['Salary']=[5000,6000,7000]

In [28]:
df

       Name  Age      City  Salary
0   Deepesh   25    Mumbai    5000
1  Akanksha   24    Mumbai    6000
2     krish   34  Banglore    7000

In [33]:
df.drop(columns='Salary',axis=1,inplace=True)

In [34]:
df

       Name  Age      City
0   Deepesh   25    Mumbai
1  Akanksha   24    Mumbai
2     krish   34  Banglore

In [35]:
## add 1 to age to column
df['Age']=df["Age"]+1

In [36]:
df

       Name  Age      City
0   Deepesh   26    Mumbai
1  Akanksha   25    Mumbai
2     krish   35  Banglore

In [37]:
df.drop(0)

       Name  Age      City
1  Akanksha   25    Mumbai
2     krish   35  Banglore

In [38]:
df

       Name  Age      City
0   Deepesh   26    Mumbai
1  Akanksha   25    Mumbai
2     krish   35  Banglore

In [39]:
df.describe()

             Age
count   3.000000
mean   28.666667
std     5.507571
min    25.000000
25%    25.500000
50%    26.000000
75%    30.500000
max    35.000000

Data Manipulation and Analysis with pandas

Data manipulation and analysis are key tasks in any data sciece or data analysis project.Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform and extract insights from data. In this lesson,we will cover various data manipulation and analysis techniques using Pandas

In [40]:
df = pd.read_csv('statsfinal.csv')

In [42]:
df.head(5)

,Unnamed: 0,Date,Q-P1,Q-P2,Q-P3,Q-P4,S-P1,S-P2,S-P3,S-P4
0,0,13-06-2010,5422,3725,576,907,17187.74,23616.50,3121.92,6466.91
1,1,14-06-2010,7047,779,3578,1574,22338.99,4938.86,19392.76,11222.62
2,2,15-06-2010,1572,2082,595,1145,4983.24,13199.88,3224.90,8163.85
3,3,16-06-2010,5657,2399,3140,1672,17932.69,15209.66,17018.80,11921.36
4,4,17-06-2010,3668,3207,2184,708,11627.56,20332.38,11837.28,5048.04

In [44]:
## describe to get men max std
df.describe()

,Unnamed: 0,Q-P1,Q-P2,Q-P3,Q-P4,S-P1,S-P2,S-P3,S-P4
count,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000
mean,2299.500000,4121.849130,2130.281522,3145.740000,1123.500000,13066.261743,13505.984848,17049.910800,8010.555000
std,1328.049949,2244.271323,1089.783705,1671.832231,497.385676,7114.340094,6909.228687,9061.330694,3546.359869
min,0.000000,254.000000,251.000000,250.000000,250.000000,805.180000,1591.340000,1355.000000,1782.500000
25%,1149.750000,2150.500000,1167.750000,1695.750000,696.000000,6817.085000,7403.535000,9190.965000,4962.480000
50%,2299.500000,4137.000000,2134.000000,3202.500000,1136.500000,13114.290000,13529.560000,17357.550000,8103.245000
75%,3449.250000,6072.000000,3070.250000,4569.000000,1544.000000,19248.240000,19465.385000,24763.980000,11008.720000
max,4599.000000,7998.000000,3998.000000,6000.000000,2000.000000,25353.660000,25347.320000,32520.000000,14260.000000

In [46]:
## handling missing values
df.isnull().sum()

Unnamed: 0    0
Date          0
Q-P1          0
Q-P2          0
Q-P3          0
Q-P4          0
S-P1          0
S-P2          0
S-P3          0
S-P4          0
dtype: int64

In [48]:
## check duplicates
df.duplicated().sum()

0

In [49]:
# if there wwould be missing value 
# df['column_name']=df['column_name'].fillna(df['column_name'].mean())

In [ ]:
## reanaming columns
##df.rename(columns={'Date':'Sales_Data'})

In [ ]:
## chg datatypes
##df['column'].astype(int)

In [ ]:
## Data Aggregating and Grouping
#df.groupby('')

In [ ]:
df=pd.DataFrame( [])